# For fourth window
coord_dict1 = {('Валерія', 'Олексій'): (210, 55, 410, 175),
               ('Анастасія', 'Юрій'): (410, 55, 210, 175),
               ('Вікторія', 'Іван'): (110, 55, 10, 175),
               ('Марія', 'Володимир'): (310, 55, 310, 175),
               ('Вікторія', 'Юрій'): (110, 55, 210, 175),
               ('Анна', 'Іван'): (10, 55, 10, 175),
               ('Анна', 'Олег'): (10, 55, 110, 175),
               ('Валерія', 'Юрій'): (210, 55, 210, 175)}

coord_dict2 = {('Валерія', 'Олексій'): (710, 55, 910, 175),
               ('Анастасія', 'Юрій'): (910, 55, 710, 175),
               ('Вікторія', 'Іван'): (610, 55, 510, 175),
               ('Марія', 'Володимир'): (810, 55, 810, 175),
               ('Вікторія', 'Юрій'): (610, 55, 710, 175),
               ('Анна', 'Іван'): (510, 55, 510, 175),
               ('Анна', 'Олег'): (510, 55, 610, 175),
               ('Валерія', 'Юрій'): (710, 55, 710, 175)}

coord_dict3 = {('Валерія', 'Олексій'): (205, 305, 405, 425),
               ('Анастасія', 'Юрій'): (405, 305, 205, 425),
               ('Вікторія', 'Іван'): (105, 305, 5, 425),
               ('Марія', 'Володимир'): (305, 305, 305, 425),
               ('Вікторія', 'Юрій'): (105, 305, 205, 425),
               ('Анна', 'Іван'): (5, 305, 5, 425),
               ('Анна', 'Олег'): (5, 305, 105, 425),
               ('Валерія', 'Юрій'): (205, 305, 205, 425)}

coord_dict4 = {('Валерія', 'Олексій'): (710, 305, 910, 425),
               ('Анастасія', 'Юрій'): (910, 305, 710, 425),
               ('Вікторія', 'Іван'): (610, 305, 510, 425),
               ('Марія', 'Володимир'): (810, 305, 810, 425),
               ('Вікторія', 'Юрій'): (610, 305, 710, 425),
               ('Анна', 'Іван'): (510, 305, 510, 425),
               ('Анна', 'Олег'): (510, 305, 610, 425),
               ('Валерія', 'Юрій'): (710, 305, 710, 425)}

coord_dict5 = {('Валерія', 'Олексій'): (210, 555, 410, 675),
               ('Анастасія', 'Юрій'): (410, 555, 210, 675),
               ('Вікторія', 'Іван'): (110, 555, 10, 675),
               ('Марія', 'Володимир'): (310, 555, 310, 675),
               ('Вікторія', 'Юрій'): (110, 555, 210, 675),
               ('Анна', 'Іван'): (10, 555, 10, 675),
               ('Анна', 'Олег'): (10, 555, 110, 675),
               ('Валерія', 'Юрій'): (210, 555, 210, 675)}

# For third window               
coord_dict_for_set_s = {('Марія', 'Володимир'): (705, 55, 705, 175),
                        ('Вікторія', 'Юрій'): (505, 55, 605, 175),
                        ('Анна', 'Іван'): (405, 55, 405, 175),
                        ('Анна', 'Олег'): (405, 55, 505, 175),
                        ('Валерія', 'Юрій'): (605, 55, 605, 175)}

coord_dict_for_set_r = {('Валерія', 'Олексій'): (605, 305, 805, 425),
                        ('Анастасія', 'Юрій'): (805, 305, 605, 425),
                        ('Вікторія', 'Іван'): (505, 305, 405, 425)}

relationships_for_granddaughter = {
    ("Марія", "Володимир"): ("Марія", "Володимир"),
    ("Валерія", "Юрій"): ("Валерія", "Юрій"),
    ("Вікторія", "Юрій"): ("Вікторія", "Юрій"),
    ("Анна", "Іван"): ("Анна", "Іван"),
    ("Анна", "Олег"): ("Анна", "Олег")
}

relationships_for_wife = {
    ("Анастасія", "Юрій"): ("Анастасія", "Юрій"),
    ("Валерія", "Олексій"): ("Валерія", "Олексій"),
    ("Вікторія", "Іван"): ("Вікторія", "Іван")
}

# General
set_u = {('Анастасія', 'Юрій'),
         ('Валерія', 'Олексій'),
         ('Вікторія', 'Іван'),
         ('Анна', 'Олег'),
         ('Вікторія', 'Юрій'),
         ('Валерія', 'Юрій'),
         ('Марія', 'Володимир'),
         ('Анна', 'Іван'),
         ('Катерина', 'Микита')}

womenlist = ["Анна", "Вікторія", "Валерія", "Марія", "Анастасія"]
menlist = ["Іван", "Олег", "Юрій", "Володимир", "Олексій"]
